#include <iostream>

using namespace std;

int main()
{
    
    setlocale(LC_ALL, "Russian");

    /*
    ================================================================================================================
    Первое задание
    ================================================================================================================
    */

    cout << "Первое задание " << endl;
    cout << "Написать программу, проверяющую что сумма двух числе лежит в пределах от 10 до 20 " << endl << endl;

    double a;
    double b;

    while (true)
    {
        cout << "Введите первое число: ";
        cin >> a;
        if (!cin)
        {
            cout << "Введено не число, введите снова\n";
            cin.clear();
            while (cin.get() != '\n');
        }
        else
        {
            break;
        }
    }

    while (true)
    {
        cout << "Введите второе число: ";
        cin >> b;
        if (!cin)
        {
            cout << "Введено не число, введите снова\n";
            cin.clear();
            while (cin.get() != '\n');
        }
        else
        {
            break;
        }
    }

    double c = a + b;

    cout << "Сумма чисел равна: " << c << endl;

    if (c >= 10 && c <= 20)
    {
        cout << "Сумма чисел ввходит дипозон от 10 до 20. Значит сумма true" << endl << endl << endl;
    }
    else
    {
        cout << "Сумма чисел не ввходит дипозон от 10 до 20. Значит сумма false" << endl << endl << endl;
    }

    /*
    ================================================================================================================
    Второе задание
    ================================================================================================================
    */

    cout << "Второе задание " << endl;
    cout << "Написать программу, выводящую на экран строку 'true', если две целочисленные константы, объявленные в ее начале " << endl << "либо обе равные десяти сами по себе, либо их сумма равна десяти. Иначе 'false' " << endl << endl;

    int d;
    int e;

    while (true)
    {
        cout << "Введите первое число: ";
        cin >> d;
        if (!cin)
        {
            cout << "Введено не число, введите снова\n";
            cin.clear();
            while (cin.get() != '\n');
        }
        else
        {
            break;
        }
    }
    while (true)
    {
        cout << "Введите второе число: ";
        cin >> e;
        if (!cin)
        {
            cout << "Введено не число, введите снова\n";
            cin.clear();
            while (cin.get() != '\n');
        }
        else
        {
            break;
        }
    }

    int f = d + e;

    cout << "Сумма равна: " << f << endl;

    if (d == 10 || e == 10 || f == 10)
    {
        cout << "true" << endl << endl << endl;
    }
    else
    {
        cout << "false" << endl << endl << endl;
    }

    /*
    ================================================================================================================
    Третье задание
    ================================================================================================================
    */

    cout << "Третье задание " << endl;
    cout << "Написать программу, которая выводит на экран список всех нечетных чисел от 1 до 50" << endl << endl;

    int g;

    cout << "Все нечетные числа: " << endl;

    for (g = 0; g <= 50; g++)
    {
        if (g % 2 == 1)
        {
            cout << g << " ";
        }
    }

    cout << endl << endl << endl;

    /*
    ================================================================================================================
    Четвертое задание
    ================================================================================================================
    */

    cout << "Четвертое задание " << endl;
    cout << "Написать программу, проверяющую, является ли некоторое число - простым" << endl << endl;

    int m = 0;

    while (true)
    {
     cout << "Введите число для проверки: ";
     cin >> m;
        if (!cin)
        {
            cout << "Введено не число, введите снова\n";
            cin.clear();
            while (cin.get() != '\n');
        }
        else if  (m < 0)
            {
                cout << "Введено число отрицательное, введите снова\n";
                cin.clear();
                while (cin.get() != '\n');
            }
            else if (m % 2 == 0)
            {
                cout << "Число является простым" << endl << endl << endl;
                break;
            }
            else
            {
                cout << "Число не является простым" << endl << endl << endl;
                break;
            }
    }

    /*
    ================================================================================================================
    Пятое задание
    ================================================================================================================
    */

    cout << "Пятое задание " << endl;
    cout << "Написать программу, которая определяет является от 1 до 3000 ли этот год высокосным" << endl << endl;

    int n;

    while (true)
    {
        cout << "Введите год для проверки: ";
        cin >> n;
        if (!cin)
        {
            cout << "Введено не год, введите снова\n";
            cin.clear();
            while (cin.get() != '\n');
        }
        else if (n < 1 || n > 3000)
        {
            cout << "Вы вышли за рамки проверки, введите снова\n";
            cin.clear();
            while (cin.get() != '\n');
        }
        else if (n % 400 == 0)
        {
            cout << "Год високосный\n";
            break;
            
        }
        else if (n % 100 == 0)
        {
            cout << "Год не високсный\n";
            break;
            
        }
        else if (n % 4 == 0)
        {
            cout << "Год високосный\n";
            break;
           
        }
        else
        {
            cout << "Год не високсный\n";
            break;
        }

    }

    return 0;
}
