#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");

    /*
    ===========================================================================================================
    Первое задание
    ===========================================================================================================
    */


    int a;
    int b;
    int c;
    int d;

    cout << "Первое задание" << endl << endl;

    cout << "Вычислим значение из такой формулы a*(b+(c/d))" << endl;
    cout << "Введите первое число: ";
    cin >> a;
    cout << "Введите второе число: ";
    cin >> b;
    cout << "Введите третье число: ";
    cin >> c;
    cout << "Введите четвертое число: ";
    cin >> d;

    float f = static_cast <float> (c) / d;
    f = static_cast <float> (b) + f;
    f = static_cast <float> (a) * f;


    cout << "Получаем число: " << f << endl << endl << endl;

    
    /*
    ===========================================================================================================
    Второе задание
    ===========================================================================================================
    */


    int g;
    int j;

    cout << "Второе задание" << endl << endl;

    cout << "Введите число: ";
    cin >> g;

    j = (g <= 21) ? 21 - g : (21 - g) * 2;
    
    if (j < 0)
    {
        cout << "Разница между заданным числом и числом 21 в удвоном значении: " << j << endl << endl << endl;
    }
    else
    {
        cout << "Разница между заданным числом и числом 21: " << j << endl << endl << endl;
    }


    /*
    ===========================================================================================================
    Третье задание
    ===========================================================================================================
    */


    cout << "Третье задание" << endl << endl;

    int Array[3][3][3], x, * pArr;
    pArr = nullptr;
    pArr = &Array[1][1][1];
    x = *pArr;

    cout << "Значения массива [1][1][1]: " << x << endl;


    return 0;
}
